In [1]:
import pandas as pd

In [3]:
three_diff_color = pd.Series(["red","blue","black"])
three_diff_color

0      red
1     blue
2    black
dtype: object

In [5]:
three_diff_car = pd.Series(["tesla","mercedes","BMW"])
three_diff_car

0       tesla
1    mercedes
2         BMW
dtype: object

In [10]:
combine_color_car = pd.DataFrame({"color": three_diff_color, "car":three_diff_car})
combine_color_car

      color       car
0     tesla     tesla
1  mercedes  mercedes
2       BMW       BMW

In [14]:
data_imported = pd.read_csv("demo-data.csv")
data = pd.DataFrame(data_imported)
data

    names  roll no   fav food   grades
0    riya       12  ice-cream       98
1  muskan       14  ice-cream       99
2   karan        1      pizza       70
3    ajay        2      momos       30
4   abhey       40      momos       50

In [15]:
data.to_csv("exercise_data.csv")

In [17]:
data.dtypes

names       object
roll no      int64
fav food    object
 grades      int64
dtype: object

In [18]:
three_diff_car.describe()

count         3
unique        3
top       tesla
freq          1
dtype: object

In [19]:
three_diff_car.info()

<class 'pandas.core.series.Series'>
RangeIndex: 3 entries, 0 to 2
Series name: None
Non-Null Count  Dtype
--------------  -----
3 non-null      object
dtypes: object(1)
memory usage: 152.0+ bytes

In [20]:
data["names"]

0      riya
1    muskan
2     karan
3      ajay
4     abhey
Name: names, dtype: object

In [23]:
data["names"].str.len()

0    4
1    6
2    5
3    4
4    5
Name: names, dtype: int64

In [24]:
data.head(2)

    names  roll no   fav food   grades
0    riya       12  ice-cream       98
1  muskan       14  ice-cream       99

In [25]:
data.tail(2)

   names  roll no fav food   grades
3   ajay        2    momos       30
4  abhey       40    momos       50

In [26]:
three_diff_car.head(1)

0    tesla
dtype: object

In [27]:
three_diff_car.tail(1)

2    BMW
dtype: object

In [28]:
data["roll no"].mean()

13.8

In [30]:
data[data["roll no"]< 14]

   names  roll no   fav food   grades
0   riya       12  ice-cream       98
2  karan        1      pizza       70
3   ajay        2      momos       30

In [39]:
car_data = pd.read_csv("car-sales.csv")
car_data

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [4]:
car_data.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [11]:
car_data["Price"]

0     $4,000.00
1     $5,000.00
2     $7,000.00
3    $22,000.00
4     $3,500.00
5     $4,500.00
6     $7,500.00
7     $7,000.00
8     $6,250.00
9     $9,700.00
Name: Price, dtype: object

In [31]:
car_data["Price"] = car_data["Price"].str.replace("[\$\,\.]", "")

In [32]:
car_data["Price"]

0     $4,000.00
1     $5,000.00
2     $7,000.00
3    $22,000.00
4     $3,500.00
5     $4,500.00
6     $7,500.00
7     $7,000.00
8     $6,250.00
9     $9,700.00
Name: Price, dtype: object

In [40]:
car_data

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [50]:
car_data["Make"] = car_data["Make"].str.lower()
car_data

     Make Colour  Odometer (KM)  Doors       Price
0  toyota  White         150043      4   $4,000.00
1   honda    Red          87899      4   $5,000.00
2  toyota   Blue          32549      3   $7,000.00
3     bmw  Black          11179      5  $22,000.00
4  nissan  White         213095      4   $3,500.00
5  toyota  Green          99213      4   $4,500.00
6   honda   Blue          45698      4   $7,500.00
7   honda   Blue          54738      4   $7,000.00
8  toyota  White          60000      4   $6,250.00
9  nissan  White          31600      4   $9,700.00

In [54]:
car_data_missing = pd.read_csv("car-sales-missing-data.csv")
car_data_missing

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [52]:
car_data_missing["Odometer"].mean(axis=0)

92302.66666666667

In [53]:
car_data_missing = car_data_missing.fillna(car_data_missing["Odometer"].mean(axis=0))
car_data_missing

           Make        Colour       Odometer         Doors         Price
0        Toyota         White  150043.000000      4.000000        $4,000
1         Honda           Red   87899.000000      4.000000        $5,000
2        Toyota          Blue   92302.666667      3.000000        $7,000
3           BMW         Black   11179.000000      5.000000       $22,000
4        Nissan         White  213095.000000      4.000000        $3,500
5        Toyota         Green   92302.666667      4.000000        $4,500
6         Honda  92302.666667   92302.666667      4.000000        $7,500
7         Honda          Blue   92302.666667      4.000000  92302.666667
8        Toyota         White   60000.000000  92302.666667  92302.666667
9  92302.666667         White   31600.000000      4.000000        $9,700

In [62]:
car_data_missing.dropna(inplace = True)

In [63]:
car_data_missing

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500

In [65]:
car_data["Seats"] = pd.Series([5,5,5,5])

In [66]:
car_data

     Make Colour  Odometer (KM)  Doors       Price  Seats
0  toyota  White         150043      4   $4,000.00    5.0
1   honda    Red          87899      4   $5,000.00    5.0
2  toyota   Blue          32549      3   $7,000.00    5.0
3     bmw  Black          11179      5  $22,000.00    5.0
4  nissan  White         213095      4   $3,500.00    NaN
5  toyota  Green          99213      4   $4,500.00    NaN
6   honda   Blue          45698      4   $7,500.00    NaN
7   honda   Blue          54738      4   $7,000.00    NaN
8  toyota  White          60000      4   $6,250.00    NaN
9  nissan  White          31600      4   $9,700.00    NaN

In [70]:
car_data.drop(columns= "Seats" , inplace= True)

In [71]:
car_data

     Make Colour  Odometer (KM)  Doors       Price
0  toyota  White         150043      4   $4,000.00
1   honda    Red          87899      4   $5,000.00
2  toyota   Blue          32549      3   $7,000.00
3     bmw  Black          11179      5  $22,000.00
4  nissan  White         213095      4   $3,500.00
5  toyota  Green          99213      4   $4,500.00
6   honda   Blue          45698      4   $7,500.00
7   honda   Blue          54738      4   $7,000.00
8  toyota  White          60000      4   $6,250.00
9  nissan  White          31600      4   $9,700.00

In [77]:
sample_data = car_data.sample(frac = 0.3)
sample_data

     Make Colour  Odometer (KM)  Doors       Price
3     bmw  Black          11179      5  $22,000.00
9  nissan  White          31600      4   $9,700.00
0  toyota  White         150043      4   $4,000.00

In [79]:
sample_data.rename( columns = {"Odometer (KM)": "Odometer (mile)"},inplace=True)

In [80]:
sample_data

     Make Colour  Odometer (mile)  Doors       Price
3     bmw  Black            11179      5  $22,000.00
9  nissan  White            31600      4   $9,700.00
0  toyota  White           150043      4   $4,000.00

In [81]:
sample_data.reset_index()

   index    Make Colour  Odometer (mile)  Doors       Price
0      3     bmw  Black            11179      5  $22,000.00
1      9  nissan  White            31600      4   $9,700.00
2      0  toyota  White           150043      4   $4,000.00